using System;

namespace RSPO_UP_15
{
    /*
     * Служащий, персона, рабочий, инженер
     * Расширить иерархию классов из задания 1 с использованием
       абстрактного класса, содержащего виртуальные методы. Показать пример использования
       полиморфизма методов. Перегрузить все имеющиеся виртуальные методы класса.
     * Реализовать для иерархии из задания 2 механизм интерфейсов, при этом каждый из
       классов должен реализовывать как минимум 2 интерфейса. Использовать для
       демонстрации всех методов переменные-коллекции интерфейса.
     * Реализовать обработку исключений системных, в крайнем случае создать свой класс
	   исключений с полями(полезными) для задания 3
	   1) StackOverflowException
	   2) ArrayTypeMismatchException
	   3) DivideByZeroException
	   4) IndexOutOfRangeException
	   5) InvalidCastException
	   6) OutOfMemoryException
	   7) OverflowException.
     * Создать классы, состоящие из 15 рабочих и списка выполненных ими работ
	   за месяц. Необходимо найти среднее количество выполняемой ими работы за рабочую
       смену, учитывая возможность различного количества рабочих дней в месяце.
     * На основании задания 1 произвести эмуляцию процесса. Выделить самый
	   эффективный класс, самый не эффективный класс. Класс выполняющий большее
       количество работы. Объект просуществовавший меньше всего, самую долгоживущую
	   единицу.
     */
    class Program
    {
        //TODO: доделать лабу, осталось два задания
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
